app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "age", "phone", "team_name", "created_at", "updated_at", "password_digest", "admin") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save